/*************************************************************************************/
// -->Template Name: Bootstrap Press Admin
// -->Author: Themedesigner
// -->Email: niravjoshi87@gmail.com
// -->File: datatable_basic_init
/*************************************************************************************/

/****************************************
 *       Basic Table                   *
 ****************************************/
$('#zero_config').DataTable();

/****************************************
 *        게시판 게시물 목록           *
 ****************************************/
$('#contents-list').DataTable({
    "order": [
        [3, "desc"]
    ]
});

/****************************************
 *           과제 게시물 목록           *
 ****************************************/

$('#assignment-list').DataTable({
    "order": [
        [3, "desc"]
    ]
});

/****************************************
 *             과제 댓글 목록           *
 ****************************************/
$('#multi_col_order').DataTable({
    columnDefs: [{
        targets: [0],
        orderData: [0, 1]
    }, {
        targets: [1],
        orderData: [1, 0]
    }, {
        targets: [4],
        orderData: [4, 0]
    }]
});